LukyLuke/STM32F4/inc/lis302dl.h
/**** Macros ****/
// TODO: Create functions from these to be able to use more that only one sensor on different SPI ports
#define LIS302DL_CS_LOW()       GPIO_ResetBits(LIS302DL_SPI_CS_GPIO_PORT, LIS302DL_SPI_CS_PIN)
#define LIS302DL_CS_HIGH()      GPIO_SetBits(LIS302DL_SPI_CS_GPIO_PORT, LIS302DL_SPI_CS_PIN)

/**
 * @brief  Write the configuration to the LIS302DL device
 * @param  LIS302DL_Config *pConfig  Pointer to the configuration to write
 * @retval void
 */
void LIS302DL_Configure(const LIS302DL_Config *config);

/**
 * @brief  Read out the configuration form a LIS302DL
 * @param  LIS302DL_Config *pConfig  Pointer to write the configuration to
 * @retval void
 */
void LIS302DL_GetConfiguration(volatile LIS302DL_Config *config);

/**
 * @brief  Read data from a LIS302DL.
 * @param  u8 *pBuffer  Pointer to the buffer for the received data
 * @param  u8 readAddr  LIS302DL Internal address from the register to read from
 * @param  u16 numByteToRead  Number of bytes to read from the LIS302DL
 * @retval void
 */
void LIS302DL_Read(u8 *pBuffer, u8 readAddr, u16 numByteToRead);

/**
 * @brief  Writes one byte to the LIS302DL.
 * @param  u8 *pBuffer  pointer to the buffer  containing the data to be written to the LIS302DL.
 * @param  u8 writeAddr  LIS302DL's internal address to write to.
 * @param  u16 NumByteToWrite  Number of bytes to write.
 * @retval void
 */
void LIS302DL_Write(u8 *pBuffer, u8 writeAddr, u16 numByteToWrite);

/**
 * @brief  Read the LIS302DL output register and calculate the acceleration based like:
 *         ACC[mg] = SENSITIVITY * (out_h * 256 + out_l) / 16 (12 bit rappresentation)
 * @param i32 *out  Buffer to store data
 * @retval void
 */
void LIS302DL_Acceleration(i32 *out);

#endif // LIS302DL_H